src/DataProcessors/ЗагрузкаДанныхОтПоставщика/ЗагрузкаДанныхОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхОтПоставщика</name>
</mdclass:DataProcessor>

src/InformationRegisters/СвободныеОстаткиПоставщиков/СвободныеОстаткиПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвободныеОстаткиПоставщиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ЗагрузкаДанныхОтПоставщика/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьСписокКодов(СписокКодов,КодТовара,КодПоставщика)
Запрос = Новый Запрос;

Товар = Справочники.Товары.ПустаяСсылка();

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Товар.Код = &Код
	|	И Материалы.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Код", КодТовара);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Материал = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
		Если Не Материал.Пустая() Тогда
		СписокКодов.Добавить(Материал,КодПоставщика); 			
		Иначе
		Сообщить(""+КодТовара+" - материал не найден по коду товара!");
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(СписокКодов)
КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	Для каждого МПЗ Из СписокКодов  Цикл
	Выборка = КонтрагентОбъект.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",МПЗ.Представление));
		Если Выборка.Количество() = 0 Тогда
		Выборка = КонтрагентОбъект.ТаблицаКодов.НайтиСтроки(Новый Структура("МПЗ",МПЗ.Значение));
			Если Выборка.Количество() = 0 Тогда
			ТЧ = КонтрагентОбъект.ТаблицаКодов.Добавить();
			ТЧ.МПЗ = МПЗ.Значение;
			ТЧ.КодПоставщика = МПЗ.Представление;
			Иначе
			Выборка[0].КодПоставщика = МПЗ.Представление;
			КонецЕсли; 
		Иначе
		Выборка[0].МПЗ = МПЗ.Значение;
		КонецЕсли;
	КонецЦикла;
КонтрагентОбъект.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоды(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c кодами поставщика");
	Если Результат <> Неопределено Тогда
	СписокКодов = Новый СписокЗначений;

	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Создание списка МПЗ по файлу..."); 
		ПолучитьСписокКодов(СписокКодов,Число(ExcelЛист.Cells(к,1).Value),СокрЛП(ExcelЛист.Cells(к,2).Value));
	    КонецЦикла;  
	Результат.Excel.Quit();
	КонецЕсли;		
		Если СписокКодов.Количество() > 0 Тогда
		Состояние("Обработка...",,"Загрузка кодов поставщика...");
		ЗагрузитьНаСервере(СписокКодов);
		КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПроверитьНаСервере(КодПоставщика)
Выборка = Контрагент.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",КодПоставщика));
	Если Выборка.Количество() = 0 Тогда
	Сообщить(КодПоставщика + " - не найден в таблице кодов поставщика!");
	Возврат(Ложь);
	КонецЕсли;
Возврат(Истина);
КонецФункции

&НаСервере
Процедура ЗагрузитьСвободныеОстаткиНаСервере(КодПоставщика,СписокДанных,СрокПоставки)
Выборка = Контрагент.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",КодПоставщика));
	Если Выборка.Количество() = 0 Тогда
	Возврат;
	КонецЕсли;
МПЗ = Выборка[0].МПЗ;
СОП = РегистрыСведений.СвободныеОстаткиПоставщиков.СоздатьНаборЗаписей();
СОП.Отбор.МПЗ.Установить(МПЗ);
СОП.Записать();
	Для каждого Данные Из СписокДанных Цикл
	КолОстатков = Число(Данные.Представление);
		Если КолОстатков > 0 Тогда
		СОП = РегистрыСведений.СвободныеОстаткиПоставщиков.СоздатьМенеджерЗаписи();
		СОП.Период = Данные.Значение;
		СОП.МПЗ = МПЗ;
		СОП.Количество = КолОстатков;
		СОП.СрокПоставки = СрокПоставки;
		СОП.Записать();	
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСвободныеОстаткиПоставщика(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл cо свободными остатками");
	Если Результат <> Неопределено Тогда
	флПроверка = Истина;
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл				
		Состояние("Проверка...",к*100/КолСтрок,"Проверка материалов из файла..."); 
			Если Не ПроверитьНаСервере(СокрЛП(ExcelЛист.Cells(к,2).Value)) Тогда
			флПроверка = Ложь;
			КонецЕсли;
	    КонецЦикла;
			Если флПроверка Тогда
			СписокДанных = Новый СписокЗначений;

			КолКолонок = Результат.КоличествоКолонок;
			    Для стр = 2 по КолСтрок Цикл
				Состояние("Обработка...",к*100/КолСтрок,"Загрузка свободных остатков из файла...");
				СписокДанных.Очистить();
					Для к = 2 по КолКолонок Цикл
						Если к = 2 Тогда
						КодПоставщика = СокрЛП(ExcelЛист.Cells(стр,2).Value);
						ИначеЕсли к = 3 Тогда
						СрокПоставки = Число(ExcelЛист.Cells(стр,3).Value);
						Иначе
						СписокДанных.Добавить(Дата(ExcelЛист.Cells(стр,к+1).Value),Строка(ExcelЛист.Cells(стр,к).Value));
						к = к + 1;						
						КонецЕсли; 					
					КонецЦикла; 
		        ЗагрузитьСвободныеОстаткиНаСервере(КодПоставщика,СписокДанных,СрокПоставки);
			    КонецЦикла;
			Иначе
			Предупреждение("Загрузите недостающие коды поставщика и повторите обработку!");
			КонецЕсли; 
	Результат.Excel.Quit();
	КонецЕсли;		  
КонецПроцедуры
